app/controllers/attachments_controller.rb

  def create
    @attachment = Attachment.create(params[:attachment])
---
INSERT INTO "attachments" ("created_at", "file_url", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 31 Jul 2013 15:46:55 UTC +00:00], ["file_url", "https://www.filepicker.io/api/file/l90pf9NsQJ6nzRcyB6Qr"], ["updated_at", Wed, 31 Jul 2013 15:46:55 UTC +00:00]]

  def show
    a = Attachment.find(params[:id])

    #now, we perform nearly the same operation
    #but, synchronously, notice the call is
    #completely different.
    a.save_page_count
---
SELECT "attachments".* FROM "attachments" WHERE "attachments"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "attachments" SET "page_count" = 2, "updated_at" = '2013-08-29 13:26:39.294024' WHERE "attachments"."id" = 13